brew "act"
brew "age"
brew "atuin"
brew "bat"
brew "btop"
brew "difftastic"
brew "direnv"
brew "dockutil"
brew "dust"
brew "eza"
brew "fd"
brew "fnm"
brew "fzf"
brew "gh"
brew "git-delta"
brew "gitleaks"
brew "glow"
brew "gnupg"
brew "gum"
brew "hyperfine"
brew "jq"
brew "just"
brew "lazygit"
brew "mas"
brew "mkcert"
brew "pinentry-mac"
brew "pnpm"
brew "ripgrep"
brew "shellcheck"
brew "shfmt"
brew "sops"
brew "aider"
brew "d2"
brew "repomix"
brew "starship"
brew "tree-sitter-cli"
brew "zellij"
brew "terminal-notifier"
brew "tmux"
brew "tokei"
brew "uv"
brew "watchexec"
brew "yazi"
brew "zoxide"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-history-substring-search"
brew "zsh-syntax-highlighting"
cask "1password"
cask "1password-cli"
cask "ghostty"
cask "hammerspoon"
cask "notion"
cask "orbstack"
cask "raycast"
cask "slack"
mas "1Password for Safari", id: 1569813296
vscode "anthropic.claude-code"
vscode "biomejs.biome"
vscode "bradlc.vscode-tailwindcss"
vscode "charliermarsh.ruff"
vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "eamodio.gitlens"
vscode "editorconfig.editorconfig"
vscode "esbenp.prettier-vscode"
vscode "github.vscode-github-actions"
vscode "moonshot-ai.kimi-code"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-playwright.playwright"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "openai.chatgpt"
vscode "redhat.vscode-yaml"
vscode "streetsidesoftware.code-spell-checker"
vscode "tamasfe.even-better-toml"
vscode "upstash.context7-mcp"
vscode "yzhang.markdown-all-in-one"
uv "browser-use"
uv "detect-secrets"
uv "httpie"
uv "ipython"
uv "llm"
uv "playwright"
uv "pre-commit"
uv "ruff"
