brew "act"
brew "atuin"
brew "bat"
brew "btop"
brew "difftastic"
brew "direnv"
brew "dockutil"
brew "dust"
brew "eza"
brew "fd"
brew "fnm"
brew "fzf"
brew "gh"
brew "git-delta"
brew "glow"
brew "gnupg"
brew "gum"
brew "htop"
brew "hyperfine"
brew "jq"
brew "just"
brew "lazygit"
brew "mas"
brew "mods"
brew "navi"
brew "node"
brew "ripgrep"
brew "starship"
brew "thefuck"
brew "tldr"
brew "tmux"
brew "tokei"
brew "tree"
brew "uv"
brew "vhs"
brew "watchexec"
brew "wget"
brew "yazi"
brew "zoxide"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-syntax-highlighting"
cask "1password"
cask "1password-cli"
cask "ghostty"
cask "hammerspoon"
cask "notion"
cask "orbstack"
cask "raycast"
cask "slack"
vscode "anthropic.claude-code"
vscode "charliermarsh.ruff"
vscode "dbaeumer.vscode-eslint"
vscode "eamodio.gitlens"
vscode "editorconfig.editorconfig"
vscode "esbenp.prettier-vscode"
vscode "github.copilot-chat"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "redhat.vscode-yaml"
vscode "streetsidesoftware.code-spell-checker"
vscode "tamasfe.even-better-toml"
vscode "yzhang.markdown-all-in-one"
uv "browser-use"
uv "httpie"
uv "ipython"
uv "llm"
uv "playwright"
uv "pre-commit"
uv "ruff"
