anthropic.claude-code
biomejs.biome
bradlc.vscode-tailwindcss
charliermarsh.ruff
davidanson.vscode-markdownlint
dbaeumer.vscode-eslint
eamodio.gitlens
editorconfig.editorconfig
esbenp.prettier-vscode
github.vscode-github-actions
moonshot-ai.kimi-code
ms-azuretools.vscode-containers
ms-azuretools.vscode-docker
ms-playwright.playwright
ms-python.debugpy
ms-python.python
ms-python.vscode-pylance
ms-python.vscode-python-envs
openai.chatgpt
redhat.vscode-yaml
streetsidesoftware.code-spell-checker
tamasfe.even-better-toml
upstash.context7-mcp
yzhang.markdown-all-in-one
